nxp-mcuxpresso/mcux-sdk-examples/rdrw612bga/cmsis_driver_examples/i2c/int_b2b_transfer/slave/pin_mux.c
/*
 * Copyright 2022 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_common.h"
#include "pin_mux.h"
#include "fsl_io_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {                                /*!< Function assigned for the core: Cortex-M33[cm33] */
    IO_MUX_SetPinMux(IO_MUX_FC3_USART_DATA);
}

void I2C2_InitPins(void)
{
    IO_MUX_SetPinMux(IO_MUX_FC2_I2C_16_17);
}

void I2C2_DeinitPins(void)
{

}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
